h2zero/n-able-Arduino/boards.txt
feather52832.menu.role.all=All
feather52832.menu.role.all.build.nimble_flags=
feather52832.menu.role.periph=Peripheral
feather52832.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
feather52832.menu.role.adv=Advertiser
feather52832.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
feather52832.menu.role.scan=Scanner
feather52832.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
feather52832.menu.role.central=Client
feather52832.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

feather52832.menu.cppDbgLvl.none=None
feather52832.menu.cppDbgLvl.none.build.cpp_debug=0
feather52832.menu.cppDbgLvl.error=Error
feather52832.menu.cppDbgLvl.error.build.cpp_debug=1
feather52832.menu.cppDbgLvl.warn=Warn
feather52832.menu.cppDbgLvl.warn.build.cpp_debug=2
feather52832.menu.cppDbgLvl.info=Info
feather52832.menu.cppDbgLvl.info.build.cpp_debug=3
feather52832.menu.cppDbgLvl.debug=Debug
feather52832.menu.cppDbgLvl.debug.build.cpp_debug=4

feather52832.menu.bootloader.adafruit=Adafruit (No softdevice)
feather52832.menu.bootloader.adafruit.bootloader.flags=-DUSE_ADA_BL
feather52832.menu.bootloader.adafruit.upload.tool=adafruit-nrfutil
feather52832.menu.bootloader.adafruit.upload.protocol=adafruit-nrfutil
feather52832.menu.bootloader.adafruit.build.ldscript=nrf52_xxaa_adabl.ld
feather52832.menu.bootloader.adafruit.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
feather52832.menu.bootloader.adafruit.build.bootloader.file=variants/{build.variant}/ada_bootloader.hex
feather52832.menu.bootloader.none=No bootloader
feather52832.menu.bootloader.none.bootloader.flags=
feather52832.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex
feather52832.menu.bootloader.none.upload.maximum_size=507904


BT5032A-TB.name=Ebyte BT5032A-TB

BT5032A-TB.upload.tool=openocd
BT5032A-TB.upload.target=nrf52
BT5032A-TB.upload.jlink_device=nRF52832_xxAA
BT5032A-TB.upload.maximum_size=507904

BT5032A-TB.bootloader.tool=openocd

BT5032A-TB.build.mcu=cortex-m4
BT5032A-TB.build.f_cpu=64000000
BT5032A-TB.build.board=BT5032A_TB
BT5032A-TB.build.core=nRF5
BT5032A-TB.build.variant=BT5032A_TB
BT5032A-TB.build.variant_system_lib=
BT5032A-TB.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BT5032A-TB.build.ldscript=nrf52832_xxaa.ld
BT5032A-TB.build.lfclk_flags=-DUSE_LFXO
BT5032A-TB.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BT5032A-TB.menu.role.all=All
BT5032A-TB.menu.role.all.build.nimble_flags=
BT5032A-TB.menu.role.periph=Peripheral
BT5032A-TB.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BT5032A-TB.menu.role.adv=Advertiser
BT5032A-TB.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BT5032A-TB.menu.role.scan=Scanner
BT5032A-TB.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BT5032A-TB.menu.role.central=Client
BT5032A-TB.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BT5032A-TB.menu.cppDbgLvl.none=None
BT5032A-TB.menu.cppDbgLvl.none.build.cpp_debug=0
BT5032A-TB.menu.cppDbgLvl.error=Error
BT5032A-TB.menu.cppDbgLvl.error.build.cpp_debug=1
BT5032A-TB.menu.cppDbgLvl.warn=Warn
BT5032A-TB.menu.cppDbgLvl.warn.build.cpp_debug=2
BT5032A-TB.menu.cppDbgLvl.info=Info
BT5032A-TB.menu.cppDbgLvl.info.build.cpp_debug=3
BT5032A-TB.menu.cppDbgLvl.debug=Debug
BT5032A-TB.menu.cppDbgLvl.debug.build.cpp_debug=4

BT5032A-TB.menu.bootloader.none=No bootloader
BT5032A-TB.menu.bootloader.none.bootloader.flags=
BT5032A-TB.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex
BT5032A-TB.menu.bootloader.adafruit=Adafruit (No softdevice)
BT5032A-TB.menu.bootloader.adafruit.bootloader.flags=-DUSE_ADA_BL
BT5032A-TB.menu.bootloader.adafruit.upload.tool=adafruit-nrfutil
BT5032A-TB.menu.bootloader.adafruit.upload.protocol=adafruit-nrfutil
BT5032A-TB.menu.bootloader.adafruit.upload.maximum_size=454656
BT5032A-TB.menu.bootloader.adafruit.build.ldscript=nrf52_xxaa_adabl.ld
BT5032A-TB.menu.bootloader.adafruit.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
BT5032A-TB.menu.bootloader.adafruit.build.bootloader.file=variants/{build.variant}/ada_bootloader.hex

bluey.name=Electronut labs bluey

bluey.upload.tool=openocd
bluey.upload.target=nrf52
bluey.upload.jlink_device=nRF52832_xxAA
bluey.upload.maximum_size=507904

bluey.bootloader.tool=openocd

bluey.build.mcu=cortex-m4
bluey.build.f_cpu=64000000
bluey.build.board=ELECTRONUT_BLUEY
bluey.build.core=nRF5
bluey.build.variant=bluey
bluey.build.variant_system_lib=
bluey.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
bluey.build.ldscript=nrf52_xxaa.ld
bluey.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

bluey.menu.lfclk.lfxo=Crystal Oscillator
bluey.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
bluey.menu.lfclk.lfrc=RC Oscillator
bluey.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
bluey.menu.lfclk.lfsynt=Synthesized
bluey.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

bluey.menu.role.all=All
bluey.menu.role.all.build.nimble_flags=
bluey.menu.role.periph=Peripheral
bluey.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
bluey.menu.role.adv=Advertiser
bluey.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
bluey.menu.role.scan=Scanner
bluey.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
bluey.menu.role.central=Client
bluey.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

bluey.menu.cppDbgLvl.none=None
bluey.menu.cppDbgLvl.none.build.cpp_debug=0
bluey.menu.cppDbgLvl.error=Error
bluey.menu.cppDbgLvl.error.build.cpp_debug=1
bluey.menu.cppDbgLvl.warn=Warn
bluey.menu.cppDbgLvl.warn.build.cpp_debug=2
bluey.menu.cppDbgLvl.info=Info
bluey.menu.cppDbgLvl.info.build.cpp_debug=3
bluey.menu.cppDbgLvl.debug=Debug
bluey.menu.cppDbgLvl.debug.build.cpp_debug=4

