h2zero/n-able-Arduino/boards.txt
cluenrf52840.menu.bootloader.adafruit=Adafruit (No softdevice)
cluenrf52840.menu.bootloader.adafruit.bootloader.flags=-DUSE_ADA_BL
cluenrf52840.menu.bootloader.adafruit.upload.tool=adafruit-nrfutil
cluenrf52840.menu.bootloader.adafruit.upload.protocol=adafruit-nrfutil
cluenrf52840.menu.bootloader.adafruit.build.ldscript=nrf52_xxaa_adabl.ld
cluenrf52840.menu.bootloader.adafruit.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
cluenrf52840.menu.bootloader.adafruit.build.bootloader.file=variants/{build.variant}/ada_bootloader.hex
cluenrf52840.menu.bootloader.none=No bootloader
cluenrf52840.menu.bootloader.none.bootloader.flags=
cluenrf52840.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex
cluenrf52840.menu.bootloader.none.upload.maximum_size=1032192


# nRF52833 variants
###################

Generic_nRF52833.name=Generic nRF52833

Generic_nRF52833.upload.tool=openocd
Generic_nRF52833.upload.target=nrf52
Generic_nRF52833.upload.jlink_device=nRF52833_xxAA
Generic_nRF52833.upload.maximum_size=507904

Generic_nRF52833.bootloader.tool=openocd

Generic_nRF52833.build.mcu=cortex-m4
Generic_nRF52833.build.f_cpu=64000000
Generic_nRF52833.build.board=GENERIC
Generic_nRF52833.build.core=nRF5
Generic_nRF52833.build.variant=Generic
Generic_nRF52833.build.variant_system_lib=
Generic_nRF52833.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52833.build.ldscript=nrf52833_xxaa.ld
Generic_nRF52833.build.extra_flags=-DNRF52_SERIES -DNRF52833_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Generic_nRF52833.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52833.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52833.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52833.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52833.menu.lfclk.lfsynt=Synthesized
Generic_nRF52833.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF52833.menu.role.all=All
Generic_nRF52833.menu.role.all.build.nimble_flags=
Generic_nRF52833.menu.role.periph=Peripheral
Generic_nRF52833.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Generic_nRF52833.menu.role.adv=Advertiser
Generic_nRF52833.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Generic_nRF52833.menu.role.scan=Scanner
Generic_nRF52833.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Generic_nRF52833.menu.role.central=Client
Generic_nRF52833.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Generic_nRF52833.menu.cppDbgLvl.none=None
Generic_nRF52833.menu.cppDbgLvl.none.build.cpp_debug=0
Generic_nRF52833.menu.cppDbgLvl.error=Error
Generic_nRF52833.menu.cppDbgLvl.error.build.cpp_debug=1
Generic_nRF52833.menu.cppDbgLvl.warn=Warn
Generic_nRF52833.menu.cppDbgLvl.warn.build.cpp_debug=2
Generic_nRF52833.menu.cppDbgLvl.info=Info
Generic_nRF52833.menu.cppDbgLvl.info.build.cpp_debug=3
Generic_nRF52833.menu.cppDbgLvl.debug=Debug
Generic_nRF52833.menu.cppDbgLvl.debug.build.cpp_debug=4

Generic_nRF52833.menu.bootloader.none=No bootloader
Generic_nRF52833.menu.bootloader.none.bootloader.flags=
Generic_nRF52833.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex


nRF52833DK.name=nRF52833 DK (PCA10100)
nRF52833DK.vid.0=0x1366
nRF52833DK.pid.0=0x1015

nRF52833DK.upload.tool=jlink
nRF52833DK.upload.protocol=jlink
nRF52833DK.upload.target=nrf52
nRF52833DK.upload.jlink_device=nRF52833_xxAA
nRF52833DK.upload.maximum_size=507904
nRF52833DK.upload.setup_command=transport select swd;

nRF52833DK.bootloader.tool=openocd

nRF52833DK.build.mcu=cortex-m4
nRF52833DK.build.f_cpu=64000000
nRF52833DK.build.board=NRF52833_DK
nRF52833DK.build.core=nRF5
nRF52833DK.build.variant=nRF52833_DK
nRF52833DK.build.variant_system_lib=
nRF52833DK.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52833DK.build.ldscript=nrf52833_xxaa.ld
nRF52833DK.build.lfclk_flags=-DUSE_LFXO
nRF52833DK.build.extra_flags=-DNRF52_SERIES -DNRF52833_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

nRF52833DK.menu.role.all=All
nRF52833DK.menu.role.all.build.nimble_flags=
nRF52833DK.menu.role.periph=Peripheral
nRF52833DK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF52833DK.menu.role.adv=Advertiser
nRF52833DK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF52833DK.menu.role.scan=Scanner
nRF52833DK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF52833DK.menu.role.central=Client
nRF52833DK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF52833DK.menu.cppDbgLvl.none=None
nRF52833DK.menu.cppDbgLvl.none.build.cpp_debug=0
nRF52833DK.menu.cppDbgLvl.error=Error
nRF52833DK.menu.cppDbgLvl.error.build.cpp_debug=1
nRF52833DK.menu.cppDbgLvl.warn=Warn
nRF52833DK.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF52833DK.menu.cppDbgLvl.info=Info
nRF52833DK.menu.cppDbgLvl.info.build.cpp_debug=3
nRF52833DK.menu.cppDbgLvl.debug=Debug
nRF52833DK.menu.cppDbgLvl.debug.build.cpp_debug=4

nRF52833DK.menu.bootloader.none=No bootloader
nRF52833DK.menu.bootloader.none.bootloader.flags=
nRF52833DK.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex


BBCmicrobitV2.name=BBC micro:bit V2

BBCmicrobitV2.vid.0=0x0d28
BBCmicrobitV2.pid.0=0x0204

BBCmicrobitV2.upload.tool=openocd
BBCmicrobitV2.upload.protocol=cmsis-dap
BBCmicrobitV2.upload.target=nrf52
BBCmicrobitV2.upload.jlink_device=nRF52833_xxAA
BBCmicrobitV2.upload.maximum_size=507904
BBCmicrobitV2.upload.setup_command=transport select swd;

