h2zero/n-able-Arduino/boards.txt
BBCmicrobitV2.bootloader.tool=openocd

BBCmicrobitV2.build.mcu=cortex-m4
BBCmicrobitV2.build.f_cpu=64000000
BBCmicrobitV2.build.board=BBC_MICROBIT_V2
BBCmicrobitV2.build.core=nRF5
BBCmicrobitV2.build.variant=BBCmicrobitV2
BBCmicrobitV2.build.variant_system_lib=
BBCmicrobitV2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BBCmicrobitV2.build.ldscript=nrf52833_xxaa.ld
BBCmicrobitV2.build.lfclk_flags=-DUSE_LFSYNT
BBCmicrobitV2.build.extra_flags=-DNRF52_SERIES -DNRF52833_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BBCmicrobitV2.menu.role.all=All
BBCmicrobitV2.menu.role.all.build.nimble_flags=
BBCmicrobitV2.menu.role.periph=Peripheral
BBCmicrobitV2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BBCmicrobitV2.menu.role.adv=Advertiser
BBCmicrobitV2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BBCmicrobitV2.menu.role.scan=Scanner
BBCmicrobitV2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BBCmicrobitV2.menu.role.central=Client
BBCmicrobitV2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BBCmicrobitV2.menu.cppDbgLvl.none=None
BBCmicrobitV2.menu.cppDbgLvl.none.build.cpp_debug=0
BBCmicrobitV2.menu.cppDbgLvl.error=Error
BBCmicrobitV2.menu.cppDbgLvl.error.build.cpp_debug=1
BBCmicrobitV2.menu.cppDbgLvl.warn=Warn
BBCmicrobitV2.menu.cppDbgLvl.warn.build.cpp_debug=2
BBCmicrobitV2.menu.cppDbgLvl.info=Info
BBCmicrobitV2.menu.cppDbgLvl.info.build.cpp_debug=3
BBCmicrobitV2.menu.cppDbgLvl.debug=Debug
BBCmicrobitV2.menu.cppDbgLvl.debug.build.cpp_debug=4

BBCmicrobitV2.menu.bootloader.none=No bootloader
BBCmicrobitV2.menu.bootloader.none.bootloader.flags=
BBCmicrobitV2.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex


# nRF51822 variants
###################

Generic_nRF51822.name=Generic nRF51822

Generic_nRF51822.upload.tool=openocd
Generic_nRF51822.upload.target=nrf52
Generic_nRF51822.upload.jlink_device=nRF51802_{build.chip}
Generic_nRF51822.upload.maximum_size=258048

Generic_nRF51822.bootloader.tool=openocd

Generic_nRF51822.build.mcu=cortex-m0
Generic_nRF51822.build.f_cpu=16000000
Generic_nRF51822.build.board=GENERIC
Generic_nRF51822.build.core=nRF5
Generic_nRF51822.build.variant=Generic
Generic_nRF51822.build.variant_system_lib=
Generic_nRF51822.build.float_flags=
Generic_nRF51822.build.ldscript=nrf51_{build.chip}.ld
Generic_nRF51822.build.extra_flags=-DNRF51 {build.ram_size} {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Generic_nRF51822.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
Generic_nRF51822.menu.chip.xxaa.build.chip=xxaa
Generic_nRF51822.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
Generic_nRF51822.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
Generic_nRF51822.menu.chip.xxac.build.chip=xxac
Generic_nRF51822.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

Generic_nRF51822.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF51822.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF51822.menu.lfclk.lfrc=RC Oscillator
Generic_nRF51822.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF51822.menu.lfclk.lfsynt=Synthesized
Generic_nRF51822.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF51822.menu.role.all=All
Generic_nRF51822.menu.role.all.build.nimble_flags=
Generic_nRF51822.menu.role.periph=Peripheral
Generic_nRF51822.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Generic_nRF51822.menu.role.adv=Advertiser
Generic_nRF51822.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Generic_nRF51822.menu.role.scan=Scanner
Generic_nRF51822.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Generic_nRF51822.menu.role.central=Client
Generic_nRF51822.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Generic_nRF51822.menu.cppDbgLvl.none=None
Generic_nRF51822.menu.cppDbgLvl.none.build.cpp_debug=0
Generic_nRF51822.menu.cppDbgLvl.error=Error
Generic_nRF51822.menu.cppDbgLvl.error.build.cpp_debug=1
Generic_nRF51822.menu.cppDbgLvl.warn=Warn
Generic_nRF51822.menu.cppDbgLvl.warn.build.cpp_debug=2
Generic_nRF51822.menu.cppDbgLvl.info=Info
Generic_nRF51822.menu.cppDbgLvl.info.build.cpp_debug=3
Generic_nRF51822.menu.cppDbgLvl.debug=Debug
Generic_nRF51822.menu.cppDbgLvl.debug.build.cpp_debug=4

Generic_nRF51822.menu.bootloader.none=No bootloader
Generic_nRF51822.menu.bootloader.none.bootloader.flags=
Generic_nRF51822.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex


nRF51DK.name=Nordic nRF51822DK (PCA10028)

nRF51DK.upload.tool=jlink
nRF51DK.upload.protocol=jlink
nRF51DK.upload.target=nrf51
nRF51DK.upload.jlink_device=nRF51802_xxaa
nRF51DK.upload.maximum_size=258048
nRF51DK.upload.setup_command=transport select swd;

nRF51DK.bootloader.tool=openocd

nRF51DK.build.mcu=cortex-m0
nRF51DK.build.f_cpu=16000000
nRF51DK.build.board=NRF51_DK
nRF51DK.build.core=nRF5
nRF51DK.build.variant=nRF51822_DK
nRF51DK.build.variant_system_lib=
nRF51DK.build.float_flags=
nRF51DK.build.ldscript=nrf51_xxaa.ld
nRF51DK.build.lfclk_flags=-DUSE_LFXO
nRF51DK.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

nRF51DK.menu.role.all=All
nRF51DK.menu.role.all.build.nimble_flags=
nRF51DK.menu.role.periph=Peripheral
nRF51DK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF51DK.menu.role.adv=Advertiser
nRF51DK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF51DK.menu.role.scan=Scanner
nRF51DK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF51DK.menu.role.central=Client
nRF51DK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF51DK.menu.cppDbgLvl.none=None
nRF51DK.menu.cppDbgLvl.none.build.cpp_debug=0
nRF51DK.menu.cppDbgLvl.error=Error
nRF51DK.menu.cppDbgLvl.error.build.cpp_debug=1
nRF51DK.menu.cppDbgLvl.warn=Warn
nRF51DK.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF51DK.menu.cppDbgLvl.info=Info
nRF51DK.menu.cppDbgLvl.info.build.cpp_debug=3
nRF51DK.menu.cppDbgLvl.debug=Debug
nRF51DK.menu.cppDbgLvl.debug.build.cpp_debug=4

