h2zero/n-able-Arduino/boards.txt
nRF51DK.menu.bootloader.none=No bootloader
nRF51DK.menu.bootloader.none.bootloader.flags=
nRF51DK.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex


BBCmicrobit.name=BBC micro:bit
BBCmicrobit.vid.0=0x0d28
BBCmicrobit.pid.0=0x0204

BBCmicrobit.upload.tool=openocd
BBCmicrobit.upload.protocol=cmsis-dap
BBCmicrobit.upload.target=nrf51
BBCmicrobit.upload.jlink_device=nRF51802_xxaa
BBCmicrobit.upload.maximum_size=258048
BBCmicrobit.upload.setup_command=transport select swd;

BBCmicrobit.bootloader.tool=openocd

BBCmicrobit.build.mcu=cortex-m0
BBCmicrobit.build.f_cpu=16000000
BBCmicrobit.build.board=BBC_MICROBIT
BBCmicrobit.build.core=nRF5
BBCmicrobit.build.variant=BBCmicrobit
BBCmicrobit.build.variant_system_lib=
BBCmicrobit.build.float_flags=
BBCmicrobit.build.ldscript=nrf51_xxaa.ld
BBCmicrobit.build.lfclk_flags=-DUSE_LFSYNT
BBCmicrobit.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BBCmicrobit.menu.role.all=All
BBCmicrobit.menu.role.all.build.nimble_flags=
BBCmicrobit.menu.role.periph=Peripheral
BBCmicrobit.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BBCmicrobit.menu.role.adv=Advertiser
BBCmicrobit.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BBCmicrobit.menu.role.scan=Scanner
BBCmicrobit.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BBCmicrobit.menu.role.central=Client
BBCmicrobit.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BBCmicrobit.menu.cppDbgLvl.none=None
BBCmicrobit.menu.cppDbgLvl.none.build.cpp_debug=0
BBCmicrobit.menu.cppDbgLvl.error=Error
BBCmicrobit.menu.cppDbgLvl.error.build.cpp_debug=1
BBCmicrobit.menu.cppDbgLvl.warn=Warn
BBCmicrobit.menu.cppDbgLvl.warn.build.cpp_debug=2
BBCmicrobit.menu.cppDbgLvl.info=Info
BBCmicrobit.menu.cppDbgLvl.info.build.cpp_debug=3
BBCmicrobit.menu.cppDbgLvl.debug=Debug
BBCmicrobit.menu.cppDbgLvl.debug.build.cpp_debug=4

BBCmicrobit.menu.bootloader.none=No bootloader
BBCmicrobit.menu.bootloader.none.bootloader.flags=
BBCmicrobit.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex


Beacon_PCA20006.name=Nordic Beacon Kit (PCA20006)

Beacon_PCA20006.upload.tool=jlink
Beacon_PCA20006.upload.target=nrf51
Beacon_PCA20006.upload.jlink_device=nRF51802_xxaa
Beacon_PCA20006.upload.maximum_size=258048

Beacon_PCA20006.bootloader.tool=openocd

Beacon_PCA20006.build.mcu=cortex-m0
Beacon_PCA20006.build.f_cpu=16000000
Beacon_PCA20006.build.board=BEACON_PCA20006
Beacon_PCA20006.build.core=nRF5
Beacon_PCA20006.build.variant=PCA20006
Beacon_PCA20006.build.variant_system_lib=
Beacon_PCA20006.build.float_flags=
Beacon_PCA20006.build.ldscript=nrf51_xxaa.ld
Beacon_PCA20006.build.lfclk_flags=-DUSE_LFXO
Beacon_PCA20006.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Beacon_PCA20006.menu.role.all=All
Beacon_PCA20006.menu.role.all.build.nimble_flags=
Beacon_PCA20006.menu.role.periph=Peripheral
Beacon_PCA20006.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Beacon_PCA20006.menu.role.adv=Advertiser
Beacon_PCA20006.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Beacon_PCA20006.menu.role.scan=Scanner
Beacon_PCA20006.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Beacon_PCA20006.menu.role.central=Client
Beacon_PCA20006.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Beacon_PCA20006.menu.cppDbgLvl.none=None
Beacon_PCA20006.menu.cppDbgLvl.none.build.cpp_debug=0
Beacon_PCA20006.menu.cppDbgLvl.error=Error
Beacon_PCA20006.menu.cppDbgLvl.error.build.cpp_debug=1
Beacon_PCA20006.menu.cppDbgLvl.warn=Warn
Beacon_PCA20006.menu.cppDbgLvl.warn.build.cpp_debug=2
Beacon_PCA20006.menu.cppDbgLvl.info=Info
Beacon_PCA20006.menu.cppDbgLvl.info.build.cpp_debug=3
Beacon_PCA20006.menu.cppDbgLvl.debug=Debug
Beacon_PCA20006.menu.cppDbgLvl.debug.build.cpp_debug=4

Beacon_PCA20006.menu.bootloader.none=No bootloader
Beacon_PCA20006.menu.bootloader.none.bootloader.flags=
Beacon_PCA20006.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex


BLENano.name=RedBearLab BLE Nano

BLENano.upload.tool=openocd
BLENano.upload.target=nrf51
BLENano.upload.jlink_device=nRF51802_{build.chip}
BLENano.upload.maximum_size=258048
BLENano.upload.protocol=cmsis-dap
BLENano.upload.setup_command=transport select swd;

BLENano.bootloader.tool=openocd

BLENano.build.mcu=cortex-m0
BLENano.build.f_cpu=16000000
BLENano.build.board=BLE_NANO
BLENano.build.core=nRF5
BLENano.build.variant=BLENano
BLENano.build.variant_system_lib=
BLENano.build.float_flags=
BLENano.build.ldscript=nrf51_{build.chip}.ld
BLENano.build.lfclk_flags=-DUSE_LFXO
BLENano.build.extra_flags=-DNRF51 {build.ram_size} {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BLENano.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
BLENano.menu.chip.xxaa.build.chip=xxaa
BLENano.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
BLENano.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
BLENano.menu.chip.xxac.build.chip=xxac
BLENano.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

BLENano.menu.role.all=All
BLENano.menu.role.all.build.nimble_flags=
BLENano.menu.role.periph=Peripheral
BLENano.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BLENano.menu.role.adv=Advertiser
BLENano.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BLENano.menu.role.scan=Scanner
BLENano.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BLENano.menu.role.central=Client
BLENano.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BLENano.menu.cppDbgLvl.none=None
BLENano.menu.cppDbgLvl.none.build.cpp_debug=0
BLENano.menu.cppDbgLvl.error=Error
BLENano.menu.cppDbgLvl.error.build.cpp_debug=1
BLENano.menu.cppDbgLvl.warn=Warn
BLENano.menu.cppDbgLvl.warn.build.cpp_debug=2
BLENano.menu.cppDbgLvl.info=Info
BLENano.menu.cppDbgLvl.info.build.cpp_debug=3
BLENano.menu.cppDbgLvl.debug=Debug
BLENano.menu.cppDbgLvl.debug.build.cpp_debug=4

